# ExternalResourceMatchOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceMatchOptions Class
Members See Also
---
Represents match options used to filter external resources when listing them from external resource server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ExternalResourceMatchOptions : IDisposable
```

Visual Basic
---
```text
Public Class ExternalResourceMatchOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ExternalResourceMatchOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ExternalResourceMatchOptions
# See Also
ExternalResourceMatchOptions Members
Autodesk.Revit.DB Namespace